zhuhuijia0001/ch559-usb-host/UsbHost.c

#include "Type.h"
#include "CH559.h"
#include "System.h"

#include "UsbDef.h"
#include "UsbHost.h"
#include "UsbHid.h"
#include "ParseDescriptor.h"

#include "KeyboardLed.h"

#include "Trace.h"

#define WAIT_USB_TOUT_200US     800  // 等待USB中断超时时间200uS

static UINT8X RxBuffer[MAX_PACKET_SIZE] _at_ 0x0000 ;  // IN, must even address
static UINT8X TxBuffer[MAX_PACKET_SIZE] _at_ 0x0040 ;  // OUT, must even address

#define RECEIVE_BUFFER_LEN    512
static UINT8X  ReceiveDataBuffer[RECEIVE_BUFFER_LEN];

//root hub port
static USB_HUB_PORT xdata RootHubPort[ROOT_HUB_PORT_NUM];

//sub hub port
static USB_HUB_PORT xdata SubHubPort[ROOT_HUB_PORT_NUM][MAX_EXHUB_PORT_NUM];

static void InitHubPortData(USB_HUB_PORT *const pUsbHubPort)
{
	int i, j;
	
	pUsbHubPort->HubPortStatus            = PORT_DEVICE_NONE;
	pUsbHubPort->UsbDevice.DeviceClass    = USB_DEV_CLASS_RESERVED;
	pUsbHubPort->UsbDevice.MaxPacketSize0 = DEFAULT_ENDP0_SIZE;
	
	pUsbHubPort->UsbDevice.VendorID       = 0x0000;
	pUsbHubPort->UsbDevice.ProductID      = 0x0000;
	pUsbHubPort->UsbDevice.bcdDevice      = 0x0000;

	pUsbHubPort->UsbDevice.DeviceAddress  = 0;
	pUsbHubPort->UsbDevice.DeviceSpeed    = FULL_SPEED;
	pUsbHubPort->UsbDevice.InterfaceNum   = 0;
		
	for (i = 0; i < MAX_INTERFACE_NUM; i++)
	{
		UINT8 k;
		
		pUsbHubPort->UsbDevice.Interface[i].InterfaceClass    = USB_DEV_CLASS_RESERVED;
		pUsbHubPort->UsbDevice.Interface[i].InterfaceProtocol = USB_PROTOCOL_NONE;
		pUsbHubPort->UsbDevice.Interface[i].ReportSize        = 0;
		
		pUsbHubPort->UsbDevice.Interface[i].EndpointNum       = 0;

		for (k = 0; k < sizeof(pUsbHubPort->UsbDevice.Interface[i].KeyboardParseStruct.KeyboardBitVal); k++)
		{
			pUsbHubPort->UsbDevice.Interface[i].KeyboardParseStruct.KeyboardBitVal[k] = 0x00;
		}

		for (k = 0; k < sizeof(pUsbHubPort->UsbDevice.Interface[i].KeyboardParseStruct.KeyboardVal); k++)
		{
			pUsbHubPort->UsbDevice.Interface[i].KeyboardParseStruct.KeyboardVal[k] = 0x00;
		}
		
		for (j = 0; j < MAX_ENDPOINT_NUM; j++)
		{
			pUsbHubPort->UsbDevice.Interface[i].Endpoint[j].EndpointAddr  = 0;
			pUsbHubPort->UsbDevice.Interface[i].Endpoint[j].MaxPacketSize = 0;
			pUsbHubPort->UsbDevice.Interface[i].Endpoint[j].EndpointDir   = ENDPOINT_IN;
			pUsbHubPort->UsbDevice.Interface[i].Endpoint[j].TOG           = FALSE;					
		}
	}
			
	pUsbHubPort->UsbDevice.HubPortNum     = 0;
}


static void InitRootHubPortData(UINT8 rootHubIndex)
{
	UINT8 i;
	
	InitHubPortData(&RootHubPort[rootHubIndex]);
		
	for (i = 0; i < MAX_EXHUB_PORT_NUM; i++)
	{
		InitHubPortData(&SubHubPort[rootHubIndex][i]);
	}
}

static UINT8 EnableRootHubPort(UINT8 rootHubIndex)
{
	if (rootHubIndex == 0)
	{
		if (USB_HUB_ST & bUHS_H0_ATTACH)
		{
			if ((UHUB0_CTRL & bUH_PORT_EN) == 0x00)
			{
				if (USB_HUB_ST & bUHS_DM_LEVEL)
				{
					RootHubPort[0].UsbDevice.DeviceSpeed = LOW_SPEED;

					TRACE("low speed device on hub 0\r\n");
				}
				else
				{
					RootHubPort[0].UsbDevice.DeviceSpeed = FULL_SPEED;

					TRACE("full speed device on hub 0\r\n");
				}

				if (RootHubPort[0].UsbDevice.DeviceSpeed == LOW_SPEED)
				{
					UHUB0_CTRL |= bUH_LOW_SPEED;
				}
			}

			UHUB0_CTRL |= bUH_PORT_EN;

			return ERR_SUCCESS;
		}
	}
	else if (rootHubIndex == 1)
	{
		if (USB_HUB_ST & bUHS_H1_ATTACH)
		{
			if ((UHUB1_CTRL & bUH_PORT_EN ) == 0x00)
			{
				if (USB_HUB_ST & bUHS_HM_LEVEL)
				{
					RootHubPort[1].UsbDevice.DeviceSpeed = LOW_SPEED;

					TRACE("low speed device on hub 1\r\n");
				}
				else
				{
					RootHubPort[1].UsbDevice.DeviceSpeed = FULL_SPEED;

					TRACE("full speed device on hub 1\r\n");
				}

				if (RootHubPort[1].UsbDevice.DeviceSpeed == LOW_SPEED)
				{
					UHUB1_CTRL |= bUH_LOW_SPEED;
				}
			}

			UHUB1_CTRL |= bUH_PORT_EN;

			return ERR_SUCCESS;
		}
	}

	return ERR_USB_DISCON;
}

static void DisableRootHubPort(UINT8 RootHubIndex)
{
	//reset data
	InitRootHubPortData(RootHubIndex);
	
	if (RootHubIndex == 0)
	{
		UHUB0_CTRL = 0x00;
	}
	else if (RootHubIndex == 1)
	{
		UHUB1_CTRL = 0x00;
	}
}

static void SetHostUsbAddr(UINT8 addr)
{
	USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}

static void SetUsbSpeed(UINT8 FullSpeed)  // set current speed
{
	if (FullSpeed)
	{
		USB_CTRL &= ~ bUC_LOW_SPEED;   // 全速
		UH_SETUP &= ~ bUH_PRE_PID_EN;  // 禁止PRE PID 
	}
	else
	{
		 USB_CTRL |= bUC_LOW_SPEED;
	}
}

static void ResetRootHubPort(UINT8 RootHubIndex)
{
    SetHostUsbAddr(0x00);
    SetUsbSpeed(1);                                            // 默认为全速
    
    if (RootHubIndex == 0)    
    {
        UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// 默认为全速,开始复位
        mDelaymS(15);                                          // 复位时间10mS到20mS
        UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET;               // 结束复位
    }
    else if (RootHubIndex == 1)
    {
        UHUB1_CTRL = UHUB1_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// 默认为全速,开始复位
        mDelaymS(15);                                          // 复位时间10mS到20mS
        UHUB1_CTRL = UHUB1_CTRL & ~ bUH_BUS_RESET;               // 结束复位
    }
    
    mDelayuS(250);
    UIF_DETECT = 0;                                              // 清中断标志
}

static void SelectHubPort(UINT8 RootHubIndex, UINT8 HubPortIndex)
{
	if (HubPortIndex == EXHUB_PORT_NONE)
	{
		//normal device
		SetHostUsbAddr(RootHubPort[RootHubIndex].UsbDevice.DeviceAddress);
		SetUsbSpeed(RootHubPort[RootHubIndex].UsbDevice.DeviceSpeed);
	}
	else
	{
		USB_DEVICE *pUsbDevice = &SubHubPort[RootHubIndex][HubPortIndex].UsbDevice;		
		SetHostUsbAddr(pUsbDevice->DeviceAddress);
		if (pUsbDevice->DeviceSpeed == LOW_SPEED)
		{
			UH_SETUP |= bUH_PRE_PID_EN;
		}

		SetUsbSpeed(pUsbDevice->DeviceSpeed);
	}
}

void InitUsbHost()
{
	UINT8	i;
	IE_USB = 0;
	
	USB_CTRL = bUC_HOST_MODE;														// 先设定模式
	USB_DEV_AD = 0x00;
	UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
	UH_RX_DMA = (UINT16)RxBuffer;
	UH_TX_DMA = (UINT16)TxBuffer;
	UH_RX_CTRL = 0x00;
	UH_TX_CTRL = 0x00;

	UHUB1_CTRL &= ~bUH1_DISABLE;   //enable root hub1
	
	USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN;							// 启动USB主机及DMA,在中断标志未清除前自动暂停

	UH_SETUP = bUH_SOF_EN;
	USB_INT_FG = 0xFF;																// 清中断标志
	for (i = 0; i < 2; i++)
	{
		DisableRootHubPort(i);													// 清空
	}
	USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
}

static UINT8 USBHostTransact(UINT8 endp_pid, UINT8 tog, UINT16 timeout)
{
    UINT8   TransRetry;
    UINT8   r;
    UINT16  i;
    UH_RX_CTRL = UH_TX_CTRL = tog;
    TransRetry = 0;
    
    do
    {
        UH_EP_PID = endp_pid;                                    // 指定令牌PID和目的端点号
        UIF_TRANSFER = 0;                                        // 允许传输
        for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i--)
        { ; }
        
        UH_EP_PID = 0x00;                                        // 停止USB传输
        
        if (UIF_TRANSFER == 0)
        {
        	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
        	
