zhuhuijia0001/ch559-usb-host/UsbHost.c
            return ( ERR_USB_UNKNOWN );
        }
        
        if ( UIF_TRANSFER )                                      // 传输完成
        {
            if ( U_TOG_OK )
            {
            	//TRACE1("retry:%d\r\n", (UINT16)TransRetry);
            	
                return ( ERR_SUCCESS );
            }

#if 0
            TRACE1("endp_pid=%02X\n",(UINT16)endp_pid);
            TRACE1("USB_INT_FG=%02X\n",(UINT16)USB_INT_FG);
            TRACE1("USB_INT_ST=%02X\n",(UINT16)USB_INT_ST);
            TRACE1("USB_MIS_ST=%02X\n",(UINT16)USB_MIS_ST);
            TRACE1("USB_RX_LEN=%02X\n",(UINT16)USB_RX_LEN);
            TRACE1("UH_TX_LEN=%02X\n",(UINT16)UH_TX_LEN);
            TRACE1("UH_RX_CTRL=%02X\n",(UINT16)UH_RX_CTRL);
            TRACE1("UH_TX_CTRL=%02X\n",(UINT16)UH_TX_CTRL);
            TRACE1("UHUB0_CTRL=%02X\n",(UINT16)UHUB0_CTRL);
            TRACE1("UHUB1_CTRL=%02X\n",(UINT16)UHUB1_CTRL);
#endif

            r = USB_INT_ST & MASK_UIS_H_RES;                     // USB设备应答状态
            //TRACE1("r:0x%02X\r\n", (UINT16)r);
            
            if ( r == USB_PID_STALL )
            {
            	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
            	
                return( r | ERR_USB_TRANSFER );
            }
            
            if ( r == USB_PID_NAK )
            {
                if ( timeout == 0 )
                {
                	//TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
                	
                    return( r | ERR_USB_TRANSFER );
                }
                if ( timeout < 0xFFFF )
                {
                    timeout --;
                }
                
                if (TransRetry > 0)
                {
                	TransRetry--;
                }
            }
            else 
            {
            	switch ( endp_pid >> 4 )
                {
                case USB_PID_SETUP:
                case USB_PID_OUT:
                    if ( r )
                    {    
                    	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
                    	
                        return( r | ERR_USB_TRANSFER );          // 不是超时/出错,意外应答
                    }
                    break;                                       // 超时重试
                    
                case USB_PID_IN:
                    if ( r == USB_PID_DATA0 && r == USB_PID_DATA1 )// 不同步则需丢弃后重试
                    {
                    }                                            // 不同步重试
                    else if ( r )
                    {       
                    	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
                    	
                        return( r | ERR_USB_TRANSFER );          // 不是超时/出错,意外应答
                    }
                    break;                                       // 超时重试
                default:
         	
                    return( ERR_USB_UNKNOWN );                   // 不可能的情况
                    break;
                }
            }
        }
        else                                                     // 其它中断,不应该发生的情况
        {
            USB_INT_FG = 0xFF;                                   //清中断标志
        }
        mDelayuS( 15 );
    }
    while ( ++ TransRetry < 30 );

	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
	
    return( ERR_USB_TRANSFER );                                  // 应答超时
}

static UINT8 HostCtrlTransfer(const USB_SETUP_REQ *const pSetupReq, UINT8 MaxPacketSize0, PUINT8 DataBuf, PUINT16 RetLen )  
{
    UINT16  RemLen  = 0;
    UINT8   s, RxLen, RxCnt, TxCnt;
    PUINT8  pBuf;
    PUINT16 pLen;

    pBuf = DataBuf;
    pLen = RetLen;
    mDelayuS( 200 );
    if ( pLen )
    {
        *pLen = 0;                                                // 实际成功收发的总长度
    }

    for (TxCnt = 0; TxCnt < sizeof(USB_SETUP_REQ); TxCnt++)
    {
		TxBuffer[TxCnt] = ((UINT8 *)pSetupReq)[TxCnt];
    }
    
    UH_TX_LEN = sizeof( USB_SETUP_REQ );
    
    s = USBHostTransact( USB_PID_SETUP << 4 | 0x00, 0x00, 200000/20 );// SETUP阶段,200mS超时
    if ( s != ERR_SUCCESS )
    { 	
    	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
    	
        return( s );
    }
    UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG;// 默认DATA1
    UH_TX_LEN = 0x01;                                            // 默认无数据故状态阶段为IN
    RemLen = (pSetupReq->wLengthH << 8) | (pSetupReq->wLengthL);
    if (RemLen && pBuf)                                        // 需要收发数据
    {
        if (pSetupReq->bRequestType & USB_REQ_TYP_IN)        // 收
        {
            while ( RemLen )
            {
                mDelayuS( 200 );
                s = USBHostTransact( USB_PID_IN << 4 | 0x00, UH_RX_CTRL, 200000/20 );// IN数据
                if ( s != ERR_SUCCESS )
                {     	
                	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
                	
                    return( s );
                }
                RxLen = USB_RX_LEN < RemLen ? USB_RX_LEN : RemLen;
                RemLen -= RxLen;
                if ( pLen )
                {
                    *pLen += RxLen;                             // 实际成功收发的总长度
                }

                for ( RxCnt = 0; RxCnt != RxLen; RxCnt ++ )
                {
                    *pBuf = RxBuffer[ RxCnt ];
                    pBuf ++;
                }
                if ( USB_RX_LEN == 0 || ( USB_RX_LEN < MaxPacketSize0) )
                {
                    break;                                      // 短包
                }
            }
            UH_TX_LEN = 0x00;                                   // 状态阶段为OUT
        }
        else                                                    // 发
        {
            while ( RemLen )
            {
                mDelayuS( 200 );
                UH_TX_LEN = RemLen >= MaxPacketSize0 ? MaxPacketSize0 : RemLen;
                
                for ( TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++ )
                {
                    TxBuffer[ TxCnt ] = *pBuf;
                    pBuf++;
                }
                s = USBHostTransact( USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, 200000/20 );// OUT数据
                if ( s != ERR_SUCCESS )
                {      
                	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
                	
                    return( s );
                }
                RemLen -= UH_TX_LEN;
                if ( pLen )
                {
                    *pLen += UH_TX_LEN;                        // 实际成功收发的总长度
                }
            }

            // 状态阶段为IN
        }
    }
    
    mDelayuS(200);
    s = USBHostTransact( ( UH_TX_LEN ? USB_PID_IN << 4 | 0x00: USB_PID_OUT << 4 | 0x00 ), bUH_R_TOG | bUH_T_TOG, 200000/20 );  // STATUS阶段
    if ( s != ERR_SUCCESS )
    { 	
    	TRACE1("quit at line %d\r\n", (UINT16)__LINE__);
    	
        return( s );
    }
    if ( UH_TX_LEN == 0 )
    {
        return( ERR_SUCCESS );                                  // 状态OUT
    }
    if ( USB_RX_LEN == 0 )
    {
        return( ERR_SUCCESS );                                  // 状态IN,检查IN状态返回数据长度
    }
    return( ERR_USB_BUF_OVER );                                 // IN状态阶段错误
}

