zhuhuijia0001/ch559-usb-host/UsbHost.c
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_CLASS | USB_REQ_RECIP_INTERF, 
				HID_SET_REPORT, HID_REPORT_OUTPUT << 8, interface, ReportLen);

	s = HostCtrlTransfer(&SetupReq, pUsbDevice->MaxPacketSize0, pReport, &len);			

	return s;
}


//-----------------------------------------------------------------------------------------------
void InitUsbData(void)
{
	int i;
	
	for (i = 0; i < ROOT_HUB_PORT_NUM; i++)
	{
		InitRootHubPortData(i);			
	}
}

static UINT8 TransferReceive(ENDPOINT *const pEndPoint, UINT8 *pData, UINT16 *pRetLen)
{
	UINT8 s;
	UINT8 len;

	s = USBHostTransact(USB_PID_IN << 4 | (pEndPoint->EndpointAddr & 0x7F), pEndPoint->TOG ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
	if (s == ERR_SUCCESS)
	{
		UINT8 i;
		len = USB_RX_LEN;
					
		for (i = 0; i < len; i++)
		{
			*pData++ = RxBuffer[i];
		}

		if (pRetLen != NULL)
		{
			*pRetLen = len;
		}
		
		pEndPoint->TOG = pEndPoint->TOG ? FALSE : TRUE;
	}
	
	return(s);
}


//-------------------------------------------------------------------------------------------
static UINT8 HIDDataTransferReceive(USB_DEVICE *const pUsbDevice)
{
	UINT8 s;
	int i, j;
	int interfaceNum;
	int endpointNum;
	
	UINT16 len;	
	interfaceNum = pUsbDevice->InterfaceNum;
	for (i = 0; i < interfaceNum; i++)
	{
		INTERFACE *pInterface = &pUsbDevice->Interface[i];
		if (pInterface->InterfaceClass == USB_DEV_CLASS_HID)
		{ 
			endpointNum = pInterface->EndpointNum;
			for (j = 0; j < endpointNum; j++)
			{
				ENDPOINT *pEndPoint = &pInterface->Endpoint[j];
				if (pEndPoint->EndpointDir == ENDPOINT_IN)
				{
					s = TransferReceive(pEndPoint, ReceiveDataBuffer, &len);
					if (s == ERR_SUCCESS)
					{
						TRACE1("interface %d data:", (UINT16)i);

						ProcessHIDData(pInterface, ReceiveDataBuffer, len);
					}
				}
			}
		}
	}
	
	return(s);
}

//enum device
static BOOL EnumerateHubPort(USB_HUB_PORT *const pUsbHubPort, UINT8 addr)
{
	UINT8 i, s;
	UINT16 len;
	UINT16 cfgDescLen;		
	
	USB_DEVICE *pUsbDevice;
	USB_CFG_DESCR *pCfgDescr;

	pUsbDevice = &pUsbHubPort->UsbDevice;
	
	//get first 8 bytes of device descriptor to get maxpacketsize0
	s = GetDeviceDescr(pUsbDevice, ReceiveDataBuffer, 8, &len);
	
	if (s != ERR_SUCCESS)
	{
		TRACE1("GetDeviceDescr failed,s:0x%02X\r\n", (UINT16)s);
		
		return(FALSE);
	}
	TRACE("GetDeviceDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	ParseDeviceDescriptor((USB_DEV_DESCR *)ReceiveDataBuffer, len, pUsbDevice);

	TRACE1("MaxPacketSize0=%bd\r\n", pUsbDevice->MaxPacketSize0);

	//set device address
	s = SetUsbAddress(pUsbDevice, addr);
	if (s != ERR_SUCCESS) 
	{
		return(FALSE);
	}

	pUsbDevice->DeviceAddress = addr;
	TRACE("SetUsbAddress OK\r\n");
	TRACE1("address=%bd\r\n", pUsbDevice->DeviceAddress);
	
	//get full bytes of device descriptor
	s = GetDeviceDescr(pUsbDevice, ReceiveDataBuffer, sizeof(USB_DEV_DESCR), &len);
	
	if (s != ERR_SUCCESS)
	{
		TRACE("GetDeviceDescr failed\r\n");
		
		return(FALSE);
	}
	
	TRACE("GetDeviceDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	ParseDeviceDescriptor((USB_DEV_DESCR *)ReceiveDataBuffer, len, pUsbDevice);
	TRACE3("VendorID=0x%04X,ProductID=0x%04X,bcdDevice=0x%04X\r\n", pUsbDevice->VendorID, pUsbDevice->ProductID, pUsbDevice->bcdDevice);

	//get configure descriptor for the first time
	cfgDescLen = sizeof(USB_CFG_DESCR);
	TRACE1("GetConfigDescr with cfgDescLen=%d\r\n", cfgDescLen);
	s = GetConfigDescr(pUsbDevice, ReceiveDataBuffer, cfgDescLen, &len);
	if (s != ERR_SUCCESS)
	{
		TRACE("GetConfigDescr 1 failed\r\n");

		return(FALSE);
	}
	
	//get configure descriptor for the second time	
	pCfgDescr = (USB_CFG_DESCR *)ReceiveDataBuffer;
	cfgDescLen = pCfgDescr->wTotalLengthL | (pCfgDescr->wTotalLengthH << 8);
	if (cfgDescLen > RECEIVE_BUFFER_LEN)
	{
		cfgDescLen = RECEIVE_BUFFER_LEN;
	}
	TRACE1("GetConfigDescr with cfgDescLen=%d\r\n", cfgDescLen);
 
	s = GetConfigDescr(pUsbDevice, ReceiveDataBuffer, cfgDescLen, &len);
	if (s != ERR_SUCCESS)
	{
		TRACE("GetConfigDescr 2 failed\r\n");
	
		return(FALSE);
	}
		
	//parse config descriptor
	ParseConfigDescriptor((USB_CFG_DESCR *)ReceiveDataBuffer, len, pUsbDevice);		
		
	TRACE("GetConfigDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	//set config	
	s = SetUsbConfig(pUsbDevice, ((USB_CFG_DESCR *)ReceiveDataBuffer)->bConfigurationValue);
	if (s != ERR_SUCCESS)
	{			
		return(FALSE);
	}

	TRACE("SetUsbConfig OK\r\n");
	TRACE1("configure=%bd\r\n", ((USB_CFG_DESCR *)ReceiveDataBuffer)->bConfigurationValue);
	
	TRACE1("pUsbDevice->InterfaceNum=%d\r\n", (UINT16)pUsbDevice->InterfaceNum);	
	
	if (pUsbDevice->DeviceClass != USB_DEV_CLASS_HUB)
	{
		for (i = 0; i < pUsbDevice->InterfaceNum; i++)
		{
#ifdef DEBUG 
			int j;
#endif
			INTERFACE *pInterface = &pUsbDevice->Interface[i];

			TRACE1("InterfaceClass=0x%02X\r\n", (UINT16)pInterface->InterfaceClass);
			TRACE1("InterfaceProtocol=0x%02X\r\n", (UINT16)pInterface->InterfaceProtocol);

#ifdef DEBUG
			for (j = 0; j < pInterface->EndpointNum; j++)
			{
				if (pInterface->Endpoint[j].EndpointDir == ENDPOINT_OUT)
				{
					TRACE1("endpoint %bd out\r\n", pInterface->Endpoint[j].EndpointAddr);
				}
				else
				{
					TRACE1("endpoint %bd in\r\n", pInterface->Endpoint[j].EndpointAddr);
				}

				TRACE1("endpoint packet size=%d\r\n", pInterface->Endpoint[j].MaxPacketSize);
			}
#endif

			if (pInterface->InterfaceClass == USB_DEV_CLASS_HID)
			{	
				s = SetIdle(pUsbDevice, 0, 0, i);
			
				if (s != ERR_SUCCESS)
				{						
					TRACE("SetIdle failed\r\n");
				}
				else
				{
					TRACE("SetIdle OK\r\n");
				}
	
				TRACE1("Interface %bd:", i);
				TRACE1("InterfaceProtocol:%bd\r\n", pInterface->InterfaceProtocol);

				TRACE1("Report Size:%d\r\n", pInterface->ReportSize);
				s = GetReportDescriptor(pUsbDevice, i, ReceiveDataBuffer, pInterface->ReportSize <= sizeof(ReceiveDataBuffer) ? pInterface->ReportSize : sizeof(ReceiveDataBuffer), &len);
							
				if (s != ERR_SUCCESS)
				{							
					return FALSE;
				}
						
				TRACE("GetReportDescriptor OK\r\n");
				TRACE1("get report descr len:%d\r\n", len);

	#ifdef DEBUG
				{
					UINT16 k;
					for (k = 0; k < len; k++)
					{
						TRACE1("0x%02X ", (UINT16)ReceiveDataBuffer[k]);
					}
					TRACE("\r\n");
				}
	#endif
				ParseReportDescriptor(ReceiveDataBuffer, len, &pInterface->HidSegStruct);


	#ifdef DEBUG
				if (pInterface->HidSegStruct.HIDSeg[HID_SEG_KEYBOARD_MODIFIER_INDEX].size != 0)
				{
					//It is a keyboard

					TRACE1("keyboard report id:%bd\r\n", pInterface->HidSegStruct.KeyboardReportId);
					
